In [2]:
### Setup 

import pandas as pd
from sqlalchemy import create_engine

In [3]:
#### Store CSV into a DF

csv_file = (r"C:\Users\rnorris\Documents\grocery.data\Groceries_dataset.csv")
grocery_data_df = pd.read_csv(csv_file)
grocery_data_df.head()

   Member_number        Date   itemDescription
0           1808  21-07-2015    tropical fruit
1           2552  05-01-2015        whole milk
2           2300  19-09-2015         pip fruit
3           1187  12-12-2015  other vegetables
4           3037  01-02-2015        whole milk

In [6]:
### Bring in another CSV file and turn into a DF

day_sell_csv = (r"C:\Users\rnorris\Documents\GitHub\ETL_project\day_sell.csv")
day_sell_df = pd.read_csv(day_sell_csv)
day_sell_df.head()

         Date       zn       sb     tax   marza
0  24.12.2017  1334.95  1903.82  284.70   284.8
1  27.12.2017  2154.40  2953.43  420.77  378.62
2  28.12.2017  2120.66  2914.20  397.22  396.14
3  29.12.2017  2280.90  3152.23  409.60  462.54
4  30.12.2017  3463.87  4823.36  629.44   730.5

In [11]:
### Rename column titles

day_sell_df = day_sell_df.rename(columns = {'Date': 'Date of Sale','zn': 'Net Purchase per day [PLN]', 'sb': 'Gross Sale per day (PLN)', 'tax': 'Tax of Sale per day (PLN)', 'marza': 'Margin per day (PLN)'})
day_sell_df.head()

,Date of Sale,Net Purchase per day,Gross Sale per day,Tax of Sale per day,Margin per day
0,24.12.2017,1334.95,1903.82,284.70,284.8
1,27.12.2017,2154.40,2953.43,420.77,378.62
2,28.12.2017,2120.66,2914.20,397.22,396.14
3,29.12.2017,2280.90,3152.23,409.60,462.54
4,30.12.2017,3463.87,4823.36,629.44,730.5